export const positionData = {
  germanTeacher: {
    title: "ინგლისურის მასწავლებელი",
    obligations: [
      "ონლაინ გაკვეთილების ჩატარება მოსწავლეებთან 18 წელს ზემოთ (1 გაკვეთილი 1 სთ 30 წთ, კვირაში სამუშაო დრო შეადგენს დაახლოებით 14-20 სთ-ს)",
      "გუნდის წევრებთან დროული კომუნიკაცია (მაგ: მოსწავლის გაცდენის თარიღების ადმინისტრატორისთვის მიწოდება) და იშვიათად რეპორტების წერა.",
      <>
        პერიოდულად გუნდთან ერთად ონლაინ და <strong>ცოცხალ</strong> შეკრებებზე
        დასწრება.
      </>,
    ],
    extraText:
      "ჩვენთვის მრავალწლიანი გამოცდილება, რეზიუმეები, ხარისხი, დიპლომები, სერთიფიკატები და ა.შ. გადამწყვეტი არ არის.",
    requirements: [
      "იყოთ მინიმუმ 22 წლის და ასწავლოთ მინიმუმ 4-6 ჯგუფს/ინდივიდუალურ მოსწავლეს - ანუ კვირაში ჩვენთვის გამოყოთ ფიქსირებულად ჯამში 14-20 საათი, რომელსაც წინასწარ თავად ადგენთ და გვითანხმებთ  *ექვემდებარება მოლაპარაკებას.",
      "იყოთ ჩვენს გუნდში მინიმუმ 6 თვით (დაინტერესებულები ვართ მხოლოდ გრძელვადიანი თანამშრომლობით)",
      "გერმანულს ფლობდეთ C1 დონეზე და ქართული იყოს მშობლიური ენა",
      "ფლობდეთ ახსნისა და გადმოცემის უნარს",
      "იყოთ ენერგიული, ორგანიზებული, კომუნიკაბელური და პასუხისმგებლიანი ჩვენი გუნდის მიმართ (რაც ჩვენი გუნდის წევრისთვის აუცილებელია)",
      "გიყვარდეთ გერმანულის სწავლება (ამ საქმის სიყვარულის გარეშე შეუძლებელია)",
      "გქონდეთ ონლაინ სწავლების გამოცდილება და იყოთ ტექნიკასთან მეგობრული",
    ],
    offer: [
      "ამ პროფესიაში განვითარების დიიიდ პერსპექტივას",
      "თქვენზე მორგებულ გრაფიკს",
      "გამზადებულ სასწავლო ელექტრონულ მასალებს",
      "მოხერხებულ ნახევარგანაკვეთურ სამუშაოს",
      "საბონუსე სისტემას",
      <>
        ცოცხალ შეკრებებზე გასართობ აქტივობებს (ჩვენი გართობები:{" "}
        <a>https://www.youtube.com/shorts/wFeKM5Woe84)</a>
      </>,
      "საინტერესო სიახლეებს",
      "ძაააალზე მხარდამჭერ და მეგობრულ გარემოს (ამას უბრალოდ არა, მართლა გპირდებით)",
    ],
    salary: (
      <>
        ანაზღაურება - გამომუშავებით.{" "}
        <strong>
          თითო ინდივიდუალურ მოსწავლეზე ანაზღაურება არის 140 - 190 ლარი, თითო
          ჯგუფზე 180 - 390 ლარი.
        </strong>{" "}
        ანაზღაურება განსხვავებულია მოსწავლეებისა და გაკვეთილების რაოდენობის
        მიხედვით.
      </>
    ),
  },
  englishTeacher: {},
  russianTeacher: {},
  chineseTeacher: {},
  contentCreator: {},
  administrator: {},
};
