type TPosition = {
  title: string;
  obligations: (string | JSX.Element)[];
  extraText?: string;
  requirements: string[];
  offer: (string | JSX.Element)[];
  salary: JSX.Element;
  location: string;
  time: string;
  salaryType: string;
  googleFormLink: string;
  metaImageUrl: string;
};

type TPositionData = {
  germanTeacher: TPosition;
  englishTeacher: TPosition;
  chineseTeacher: TPosition;
  contentCreator: TPosition;
  administrator: TPosition;
};

export const positionData: TPositionData = {
  germanTeacher: {
    title: "გერმანულის მასწავლებელი",
    obligations: [
      "ონლაინ გაკვეთილების ჩატარება მოსწავლეებთან 18 წელს ზემოთ (1 გაკვეთილი 1 სთ 30 წთ, კვირაში სამუშაო დრო შეადგენს დაახლოებით 14-20 სთ-ს)",
      "გუნდის წევრებთან დროული კომუნიკაცია (მაგ: მოსწავლის გაცდენის თარიღების ადმინისტრატორისთვის მიწოდება) და იშვიათად რეპორტების წერა.",
      <>
        პერიოდულად გუნდთან ერთად ონლაინ და <strong>ცოცხალ</strong> შეკრებებზე
        დასწრება.
      </>,
    ],
    extraText:
      "ჩვენთვის მრავალწლიანი გამოცდილება, რეზიუმეები, ხარისხი, დიპლომები, სერთიფიკატები და ა.შ. გადამწყვეტი არ არის.",
    requirements: [
      "იყოთ მინიმუმ 22 წლის და ასწავლოთ მინიმუმ 4-6 ჯგუფს/ინდივიდუალურ მოსწავლეს - ანუ კვირაში ჩვენთვის გამოყოთ ფიქსირებულად ჯამში 14-20 საათი, რომელსაც წინასწარ თავად ადგენთ და გვითანხმებთ  *ექვემდებარება მოლაპარაკებას.",
      "იყოთ ჩვენს გუნდში მინიმუმ 6 თვით (დაინტერესებულები ვართ მხოლოდ გრძელვადიანი თანამშრომლობით)",
      "გერმანულს ფლობდეთ C1 დონეზე და ქართული იყოს მშობლიური ენა",
      "ფლობდეთ ახსნისა და გადმოცემის უნარს",
      "იყოთ ენერგიული, ორგანიზებული, კომუნიკაბელური და პასუხისმგებლიანი ჩვენი გუნდის მიმართ (რაც ჩვენი გუნდის წევრისთვის აუცილებელია)",
      "გიყვარდეთ გერმანულის სწავლება (ამ საქმის სიყვარულის გარეშე შეუძლებელია)",
      "გქონდეთ ონლაინ სწავლების გამოცდილება და იყოთ ტექნიკასთან მეგობრული",
    ],
    offer: [
      "ამ პროფესიაში განვითარების დიიიდ პერსპექტივას",
      "თქვენზე მორგებულ გრაფიკს",
      "გამზადებულ სასწავლო ელექტრონულ მასალებს",
      "მოხერხებულ ნახევარგანაკვეთურ სამუშაოს",
      "საბონუსე სისტემას",
      <>
        ცოცხალ შეკრებებზე გასართობ აქტივობებს (ჩვენი გართობები{" "}
        <a
          className="underline text-lingo-green"
          href="https://www.youtube.com/shorts/wFeKM5Woe84"
          target="_blank"
        >
          იხილეთ აქ
        </a>
        )
      </>,
      "საინტერესო სიახლეებს",
      "ძაააალზე მხარდამჭერ და მეგობრულ გარემოს (ამას უბრალოდ არა, მართლა გპირდებით)",
      "წამახალისებელ საჩუქრებს (მაისური, ჭიქა, ჩანთა და ა.შ), რომლებსაც ჩვენი გუნდის ერთგულ წევრებს ტრადიციულად ვჩუქნით",
    ],
    salary: (
      <>
        ვაკანსიის საწყისი ეტაპი გულისხმობს სტაჟირებას ჯუნიორ მასწავლებლებისთვის,
        რომელიც მოიცავს 50 ჩასატარებელ გაკვეთილს - დაახლოებით 2-3 თვე. ლიმიტის
        წარმატებულად დაფარვის შემდგომ ხდებით გუნდის სენიორ მასწავლებელი.
        ანაზღაურება - გამომუშავებით ჩატარებული გაკვეთილების შესაბამისად.
        <br />
        <br />
        ჯუნიორ მასწავლებლებისთვის ანაზღაურება შეადგენს{" "}
        <strong>
          თითო ინდივიდუალურ მოსწავლეზე თვეში 100 - 150 ლარს, თითო ჯგუფზე 140 -
          350 ლარს.
        </strong>{" "}
        ანაზღაურება განსხვავებულია მოსწავლეებისა და გაკვეთილების რაოდენობის
        მიხედვით.
        <br />
        <br />
        სენიორ მასწავლებლებისთვის ანაზღაურება შეადგენს{" "}
        <strong>
          თითო ინდივიდუალურ მოსწავლეზე თვეში 140 - 190 ლარს, თითო ჯგუფზე 180 -
          390 ლარს.
        </strong>
        <br />
        <br />
        თუკი კანდიდატი ფლობს გერმანულის სწავლების მინიმუმ 1 წლიან გამოცდილებას
        და შერჩევის სამივე ეტაპს უმაღლესი შედეგებით გაივლის, მისთვის სტაჟირების
        ხანგრძლივობა იქნება მხოლოდ 1 თვე.
      </>
    ),
    location: "თბილისი",
    time: "ნახევარი",
    salaryType: "კონკურენტული",
    googleFormLink: "https://forms.gle/ZfJecL1KtjVWrX117",
    metaImageUrl: "https://i.ibb.co/y5nVfrB/ger.png",
  },
  englishTeacher: {
    title: "ინგლისურის მასწავლებელი",
    obligations: [
      "ონლაინ გაკვეთილების ჩატარება მოსწავლეებთან 18 წელს ზემოთ (1 გაკვეთილი 1 სთ 30 წთ, კვირაში სამუშაო დრო შეადგენს დაახლოებით 23 სთ-ს)",
      "გუნდის წევრებთან დროული კომუნიკაცია (მაგ: მოსწავლის გაცდენის თარიღების ადმინისტრატორისთვის მიწოდება) და იშვიათად რეპორტების წერა.",
      <>
        პერიოდულად გუნდთან ერთად ონლაინ და <strong>ცოცხალ</strong> შეკრებებზე
        დასწრება.
      </>,
    ],
    extraText:
      "ჩვენთვის მრავალწლიანი გამოცდილება, რეზიუმეები, ხარისხი, დიპლომები, სერთიფიკატები და ა.შ. გადამწყვეტი არ არის.",
    requirements: [
      "იყოთ მინიმუმ 22 წლის და ასწავლოთ მინიმუმ 7 ჯგუფს/ინდივიდუალურ მოსწავლეს - ანუ კვირაში ჩვენთვის გამოყოთ ფიქსირებულად ჯამში 23 საათი, რომელსაც წინასწარ თავად ადგენთ და გვითანხმებთ.",
      "იყოთ ჩვენს გუნდში მინიმუმ 6 თვით (დაინტერესებულები ვართ მხოლოდ გრძელვადიანი თანამშრომლობით)",
      "ინგლისურს ფლობდეთ C1 დონეზე და ქართული იყოს მშობლიური ენა",
      "ფლობდეთ ახსნისა და გადმოცემის უნარს",
      "იყოთ ენერგიული, ორგანიზებული, კომუნიკაბელური და პასუხისმგებლიანი ჩვენი გუნდის მიმართ (რაც ჩვენი გუნდის წევრისთვის აუცილებელია)",
      "გიყვარდეთ ინგლისურის სწავლება (ამ საქმის სიყვარულის გარეშე შეუძლებელია)",
      "გქონდეთ ონლაინ სწავლების გამოცდილება და იყოთ ტექნიკასთან მეგობრული",
    ],
    offer: [
      "ამ პროფესიაში განვითარების დიიიდ პერსპექტივას",
      "თქვენზე მორგებულ გრაფიკს",
      "გამზადებულ სასწავლო ელექტრონულ მასალებს",
      "მოხერხებულ ნახევარგანაკვეთურ სამუშაოს",
      "საბონუსე სისტემას",
      <>
        ცოცხალ შეკრებებზე გასართობ აქტივობებს (ჩვენი გართობები:{" "}
        <a
          className="underline text-lingo-green"
          href="https://www.youtube.com/shorts/wFeKM5Woe84"
          target="_blank"
        >
          იხილეთ აქ
        </a>
        )
      </>,
      "საინტერესო სიახლეებს",
      "ძაააალზე მხარდამჭერ და მეგობრულ გარემოს (ამას უბრალოდ არა, მართლა გპირდებით)",
      "წამახალისებელ საჩუქრებს (მაისური, ჭიქა, ჩანთა და ა.შ), რომლებსაც ჩვენი გუნდის ერთგულ წევრებს ტრადიციულად ვჩუქნით",
    ],
    salary: (
      <>
        ვაკანსიის საწყისი ეტაპი გულისხმობს სტაჟირებას ჯუნიორ მასწავლებლებისთვის,
        რომელიც მოიცავს 50 ჩასატარებელ გაკვეთილს - დაახლოებით 2-3 თვე. ლიმიტის
        წარმატებულად დაფარვის შემდგომ ხდებით გუნდის სენიორ მასწავლებელი.
        ანაზღაურება - გამომუშავებით ჩატარებული გაკვეთილების შესაბამისად.
        <br />
        <br />
        ჯუნიორ მასწავლებლებისთვის ანაზღაურება შეადგენს{" "}
        <strong>
          თითო ინდივიდუალურ მოსწავლეზე თვეში 90 - 130 ლარს, თითო ჯგუფზე 120 -
          260 ლარს.
        </strong>{" "}
        ანაზღაურება განსხვავებულია მოსწავლეებისა და გაკვეთილების რაოდენობის
        მიხედვით.
        <br />
        <br />
        სენიორ მასწავლებლებისთვის ანაზღაურება შეადგენს{" "}
        <strong>
          თითო ინდივიდუალურ მოსწავლეზე თვეში 130 - 170 ლარს, თითო ჯგუფზე 160 -
          300 ლარს.
        </strong>
        <br />
        <br />
        თუკი კანდიდატი ფლობს ინგლისურის სწავლების მინიმუმ 1 წლიან გამოცდილებას
        და შერჩევის სამივე ეტაპს უმაღლესი შედეგებით გაივლის, მისთვის სტაჟირების
        ხანგრძლივობა იქნება მხოლოდ 1 თვე.
      </>
    ),
    location: "თბილისი",
    time: "ნახევარი",
    salaryType: "კონკურენტული",
    googleFormLink: "https://forms.gle/KnmQ195et7hcYwYa8",
    metaImageUrl: "https://i.ibb.co/gSSWFgt/eng.png",
  },
  chineseTeacher: {
    title: "ჩინურის მასწავლებელი",
    obligations: [
      "ონლაინ გაკვეთილების ჩატარება მოსწავლეებთან 18 წელს ზემოთ (1 გაკვეთილი 1 სთ 30 წთ, კვირაში სამუშაო დრო შეადგენს დაახლოებით 17-20 სთ)",
      "გუნდის წევრებთან დროული კომუნიკაცია (მაგ: მოსწავლის გაცდენის თარიღების ადმინისტრატორისთვის მიწოდება) და იშვიათად რეპორტების წერა.",
      <>
        პერიოდულად გუნდთან ერთად ონლაინ და <strong>ცოცხალ</strong> შეკრებებზე
        დასწრება.
      </>,
    ],
    extraText:
      "ჩვენთვის მრავალწლიანი გამოცდილება, რეზიუმეები, ხარისხი, დიპლომები, სერთიფიკატები და ა.შ. გადამწყვეტი არ არის.",
    requirements: [
      "იყოთ მინიმუმ 22 წლის და ასწავლოთ მინიმუმ 5-6 ჯგუფს/ინდივიდუალურ მოსწავლეს - ანუ კვირაში ჩვენთვის გამოყოთ ფიქსირებულად ჯამში 17-20 საათი, რომელსაც წინასწარ თავად ადგენთ და გვითანხმებთ.",
      "იყოთ ჩვენს გუნდში მინიმუმ 6 თვით (დაინტერესებულები ვართ მხოლოდ გრძელვადიანი თანამშრომლობით)",
      "ჩინურს ფლობდეთ C1 დონეზე და ქართული იყოს მშობლიური ენა",
      "ფლობდეთ ახსნისა და გადმოცემის უნარს",
      "იყოთ ენერგიული, ორგანიზებული, კომუნიკაბელური და პასუხისმგებლიანი ჩვენი გუნდის მიმართ (რაც ჩვენი გუნდის წევრისთვის აუცილებელია)",
      "გიყვარდეთ ჩინურის სწავლება (ამ საქმის სიყვარულის გარეშე შეუძლებელია)",
      "გქონდეთ ონლაინ სწავლების გამოცდილება და იყოთ ტექნიკასთან მეგობრული",
    ],
    offer: [
      "ამ პროფესიაში განვითარების დიიიდ პერსპექტივას",
      "თქვენზე მორგებულ გრაფიკს",
      "გამზადებულ სასწავლო ელექტრონულ მასალებს",
      "მოხერხებულ ნახევარგანაკვეთურ სამუშაოს",
      "საბონუსე სისტემას",
      <>
        ცოცხალ შეკრებებზე გასართობ აქტივობებს (ჩვენი გართობები:{" "}
        <a
          className="underline text-lingo-green"
          href="https://www.youtube.com/shorts/wFeKM5Woe84"
          target="_blank"
        >
          იხილეთ აქ
        </a>
        )
      </>,
      "საინტერესო სიახლეებს",
      "ძაააალზე მხარდამჭერ და მეგობრულ გარემოს (ამას უბრალოდ არა, მართლა გპირდებით)",
      "წამახალისებელ საჩუქრებს (მაისური, ჭიქა, ჩანთა და ა.შ), რომლებსაც ჩვენი გუნდის ერთგულ წევრებს ტრადიციულად ვჩუქნით",
    ],
    salary: (
      <>
        ვაკანსიის საწყისი ეტაპი გულისხმობს სტაჟირებას ჯუნიორ მასწავლებლებისთვის,
        რომელიც მოიცავს 50 ჩასატარებელ გაკვეთილს - დაახლოებით 2-3 თვე. ლიმიტის
        წარმატებულად დაფარვის შემდგომ ხდებით გუნდის სენიორ მასწავლებელი.
        ანაზღაურება - გამომუშავებით ჩატარებული გაკვეთილების შესაბამისად.
        <br />
        <br />
        ჯუნიორ მასწავლებლებისთვის ანაზღაურება შეადგენს{" "}
        <strong>
          თითო ინდივიდუალურ მოსწავლეზე თვეში 130 - 200 ლარს, თითო ჯგუფზე 190 -
          450 ლარს.
        </strong>{" "}
        ანაზღაურება განსხვავებულია მოსწავლეებისა და გაკვეთილების რაოდენობის
        მიხედვით.
        <br />
        <br />
        სენიორ მასწავლებლებისთვის ანაზღაურება შეადგენს{" "}
        <strong>
          თითო ინდივიდუალურ მოსწავლეზე თვეში 170 - 240 ლარს, თითო ჯგუფზე 230 -
          490 ლარს.
        </strong>
        <br />
        <br />
        თუკი კანდიდატი ფლობს ჩინურის სწავლების მინიმუმ 1 წლიან გამოცდილებას და
        შერჩევის სამივე ეტაპს უმაღლესი შედეგებით გაივლის, მისთვის სტაჟირების
        ხანგრძლივობა იქნება მხოლოდ 1 თვე.
      </>
    ),
    location: "თბილისი",
    time: "ნახევარი",
    salaryType: "კონკურენტული",
    googleFormLink: "https://forms.gle/j91uKUvSba3VJ7DD6",
    metaImageUrl: "https://i.ibb.co/K9qNFxR/chi.png",
  },

  contentCreator: {
    title: "კონტენტ კრეატორი",
    obligations: [
      "კონტენტ იდეების გენერირება, შექმნა და განთავსება სოციალურ პლატფორმებზე",
      "ვიდეო ტრენდების მარტივი ანალიტიკა სკოლის დამფუძნებელთან ერთად",
      "ფიზიკურად მონაწილეობის მიღება კონტენტის შექმნაში (ვიდეოების გადაღება) დამფუძნებელთან ერთად პერიოდულად.",
      <>
        პერიოდულად გუნდთან ერთად ონლაინ და <strong>ცოცხალ</strong> შეკრებებზე
        დასწრება.
      </>,
    ],
    extraText:
      "არ ვითხოვთ თქვენგან გამოცდილებას და დიდ მიღწევებს ამ სფეროში, ჩვენთვის პროფესიული განვითარების სურვილი ყველაზე მნიშვნელოვანია.",
    requirements: [
      "იყოთ დაინტერესებული ციფრული მარკეტინგით",
      "გაინტერესებდეთ პლატფორმები, როგორებიცაა Tiktok, Facebook reels, Instagram",
      "გქონდეთ განვითარებისა და გამოცდილების მიღების ძლიერი სურვილი",
      "ფლობდეთ ინგლისურს მინიმუმ საკომუნიკაციო დონეზე",
      "იყოთ ორგანიზებული და პასუხისმგებლიანი მთლიანი გუნდის მიმართ (რაც ჩვენი გუნდის წევრისთვის აუცილებელია)",
    ],
    offer: [
      "ყოველთვიურ ხელფასს 500 ლარის ოდენობით",
      "ამ სფეროში დიდ განვითარებას და უზარმაზარ გამოცდილებას",
      "არაიერარქიულ და მეგობრულ გარემოს (ამას უბრალოდ არა, მართლა გპირდებით)",
      "მოხერხებულ ნახევარგანაკვეთურ სამუშაო გრაფიკს (გრაფიკს ათანხმებთ სკოლის დამფუძნებელთან, რომელთანაც გექნებათ ხშირი კომუნიკაცია)",
      "საბონუსე სისტემას",
      "პლატფორმა Canva-ს პრემიუმ პაკეტს (რომელიც კონტენტის შესაქმნელად დაგჭირდებათ)",
      <>
        ცოცხალ შეკრებებზე გასართობ აქტივობებს (ჩვენი გართობები:{" "}
        <a
          className="underline text-lingo-green"
          href="https://www.youtube.com/shorts/wFeKM5Woe84"
          target="_blank"
        >
          იხილეთ აქ
        </a>
        )
      </>,
      "საინტერესო სიახლეებს",
      "ძაააალზე მხარდამჭერ და მეგობრულ გარემოს (ამას უბრალოდ არა, მართლა გპირდებით)",
      "წამახალისებელ საჩუქრებს (მაისური, ჭიქა, ჩანთა და ა.შ), რომლებსაც ჩვენი გუნდის ერთგულ წევრებს ტრადიციულად ვჩუქნით",
    ],
    salary: <></>,
    location: "თბილისი",
    time: "ნახევარი",
    salaryType: "კონკურენტული",
    googleFormLink: "https://forms.gle/qTVPZUeTDtcwWjQj9",
    metaImageUrl: "https://i.ibb.co/7XR82K7/con.png",
  },

  administrator: {
    title: "ადმინისტრატორი",
    obligations: [
      "მუშაობა ნახევარი განაკვეთით დისტანციურად - ორშაბათიდან პარასკევის ჩათვლით დილის/შუადღის/საღამოს საათები (შეთანხმებით)",
      "შაბათ-კვირას შემოსული ზარებისა და შეტყობინებების პასუხის გაცემა (არსებობის შემთხვევაში)",
    ],
    extraText:
      "არ ვითხოვთ თქვენგან გამოცდილებას და დიდ მიღწევებს ამ სფეროში, ჩვენთვის პროფესიული განვითარების სურვილი ყველაზე მნიშვნელოვანია.",
    requirements: [
      "იყოთ კომუნიკაბელური (ადამიანებთან ხშირი დაკონტაქტება, მათთვის სატელეფონო ზარებითა და წერილობითი ფორმით სასწავლო პირობების შესახებ ინფორმაციის მიწოდება, მოსწავლეების შეფასების მოსმენა და სხვა)",
      "იყოთ ორგანიზებული (მოსწავლეების გაცდენებისა და გადახდის თარიღების ჩანიშვნა, ფბ/ინსტაგრამ გვერდზე პასუხების გაცემა, მეილების გაგზავნა, პერიოდულად ვიდეო შეხვედრებზე დასწრება, მასწავლებლის გრაფიკის მიხედვით მოსწავლეების მათთან განაწილება)",
      "აიღოთ პასუხისმგებლობა მთლიანი გუნდის მიმართ (რაც ჩვენი გუნდის წევრისთვის აუცილებელია)",
      "იცოდეთ საოფისე პროგრამები: Gmail, Google Drive, Google Sheets, Google Forms",
    ],
    offer: [
      "მეგობრულ და მხარდამჭერ გუნდს (ამას უბრალოდ არა, მართლა გპირდებით)",
      "ინტენსიურ პრაქტიკას საზოგადოებასთან ურთიერთობაში",
      "თქვენზე მორგებულ გრაფიკს",
      "ფიქსირებულ ანაზღაურებას 400 ლარის ოდენობით",
      "სატელეფონო ნომერს ულიმიტო პაკეტით (დაგჭირდებათ ორბარათიანი ან ელექტრო სიმბარათიანი ტელეფონი)",
      <>
        ცოცხალ შეკრებებზე გასართობ აქტივობებს (ჩვენი გართობები:{" "}
        <a
          className="underline text-lingo-green"
          href="https://www.youtube.com/shorts/wFeKM5Woe84"
          target="_blank"
        >
          იხილეთ აქ
        </a>
        )
      </>,
      "საინტერესო სიახლეებს",
      "ძაააალზე მხარდამჭერ და მეგობრულ გარემოს (ამას უბრალოდ არა, მართლა გპირდებით)",
      "წამახალისებელ საჩუქრებს (მაისური, ჭიქა, ჩანთა და ა.შ), რომლებსაც ჩვენი გუნდის ერთგულ წევრებს ტრადიციულად ვჩუქნით",
    ],
    salary: <></>,
    location: "თბილისი",
    time: "ნახევარი",
    salaryType: "კონკურენტული",
    googleFormLink: "https://forms.gle/sNGvDbdSdDoi7oXA9",
    metaImageUrl: "https://i.ibb.co/dBf0MSG/admin.png",
  },
};
